/* eslint-disable prettier/prettier */

const locale: LsrLocale = {
  name: 'zh-cn',
  stemFetalGodPlace: ['门', '碓磨', '厨灶', '仓库', '房床'],
  branchFetalGodPlace: ['碓', '厕', '炉', '门', '鸡栖', '床'],

  //                   0      1     2      3    4       5     6       7     8
  fetalGodDirection: ['中', '东', '东南', '南', '西南', '西', '西北', '北', '东北'],

  fetalGodDayDesc: [
    // 甲            乙             丙             丁            戊             己              庚             辛             壬             癸
    '占门碓外东南', '碓磨厕外东南', '厨灶炉外正南', '仓库门外正南', '房床栖外正南', '占门床外正南', '占碓磨外正南', '厨灶厕外西南', '仓库炉外西南', '房床门外西南',
    '门鸡栖外西南', '碓磨床外西南', '厨灶碓外西南', '仓库厕外正西', '房床炉外正西', '占大门外正西', '碓磨栖外正西', '厨灶床外正西', '仓库碓外西北', '房床厕外西北',
    '占门炉外西北', '门碓磨外西北', '厨灶栖外西北', '仓库床外西北', '房床碓外正北', '占门厕外正北', '碓磨炉外正北', '厨灶门外正北', '仓库栖外正北', '占房床房内北',
    '占门碓房内北', '碓磨厕房内北', '厨灶炉房内北', '门仓库房内北', '房床栖房内中', '占门床房内中', '占碓磨房内南', '厨灶厕房内南', '仓库炉房内南', '房床门房内西',
    '门鸡栖房内东', '碓磨床房内东', '厨灶碓房内东', '仓库厕房内东', '房床炉房内中', '占大门外东北', '碓磨栖外东北', '厨灶床外东北', '仓库碓外东北', '房床厕外东北',
    '占门炉外东北', '门碓磨外正东', '厨灶栖外正东', '仓库床外正东', '房床碓外正东', '占门厕外正东', '碓磨炉外东南', '厨灶门外东南', '仓库栖外东南', '占房床外东南'
  ],

  fetalGodInsideDesc: '内',
  fetalGodOutsideDesc: '外',

}

export default locale