/* eslint-disable prettier/prettier */

export const LUNAR_MONTH_NAMES = [
  '正月','二月','三月','四月','五月','六月','七月','八月','九月','十月','冬月','腊月'
]

export const LUNAR_DATE_NAMES = [
  '初一','初二','初三','初四','初五','初六','初七','初八','初九','初十','十一','十二','十三',
  '十四','十五','十六','十七','十八','十九','二十','廿一','廿二','廿三','廿四','廿五','廿六',
  '廿七','廿八','廿九','三十'
]

export const NUMBER_STRING = '〇一二三四五六七八九十'

// 星座
export const CONSTELLATION_NAME = [
  '白羊座',
  '金牛座',
  '双子座',
  '巨蟹座',
  '狮子座',
  '处女座',
  '天秤座',
  '天蝎座',
  '射手座',
  '摩羯座',
  '水瓶座',
  '双鱼座'
]

// 二十四节气
export const SOLAR_TERMS = [
  '小寒','大寒',
  '立春','雨水','惊蛰','春分','清明','谷雨',
  '立夏','小满','芒种','夏至','小暑','大暑',
  '立秋','处暑','白露','秋分','寒露','霜降',
  '立冬','小雪','大雪','冬至'
]

// 二十八星宿
export const wentyEightStars = [
  // 四       五      六       日       一       二      三
  '角木蛟','亢金龙','女土蝠','房日兔','心月狐','尾火虎','箕水豹',
  '斗木獬','牛金牛','氐土貉','虚日鼠','危月燕','室火猪','壁水獝',
  '奎木狼','娄金狗','胃土彘','昴日鸡','毕月乌','觜火猴','参水猿',
  '井木犴','鬼金羊','柳土獐','星日马','张月鹿','翼火蛇','轸水蚓'
]

// 天干                0     1    2     3     4     5     6     7     8     9
export const STEMS = ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸']

//地支
export const BRANCHS = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥']

// 五行
export const FIVE_ELEMENTS = ['木', '火', '土', '金', '水']


/**
  --- 地支藏干表 ---
  寅藏戊土及丙甲，卯中同居甲和乙，辰藏乙木癸水戊，
  巳宫戊土同庚丙。午中丙火并己丁，未宫再居丁乙己，
  申中戊土壬庚逢，酉宫同见庚辛隆。戍藏辛金和丁戊，
  亥宫戊甲壬同户，子宫壬癸在其中，丑中癸辛己土同。
 */
export const HIDDEN_STEMS = [
  [9], [5, 9, 7],  // 子丑
  [0, 2, 4], [1], [4, 1, 9], // 寅卯辰
  [2, 6, 4], [3, 5], [5, 3, 1],  // 巳午未
  [6, 8, 4], [7], [4, 7, 3], // 申酉戌
  [8, 0] // 亥
]

// 五行得分
export const FIVE_ELEMENTS_SCORE = [60, 30, 10]

// 甲子日标识
export const SB0_DATE = [2018, 12, 7]
