/* eslint-disable prettier/prettier */


// 胎神逐日占遊方定局
export const FETAL_GOD_DAY_DIRECTION = [
  2,  2,  3,  3,  3,  3,  3,  4,  4,  4, 
  4,  4,  4,  5,  5,  5,  5,  5,  6,  6,
  6,  6,  6,  6,  7,  7,  7,  7,  7, -7,
 -7, -7, -7, -7,  0,  0, -3, -3, -3, -5,
 -1, -1, -1, -1,  0,  8,  8,  8,  8,  8,
  8,  1,  1,  1,  1,  1,  2,  2,  2,  2
]


/**
  另一种方位，（暂时没用上）
　　辛未 壬申 癸酉 甲戌 乙亥 丙子 丁丑 胎神在外西南停留7天
　　戊寅 己卯                         胎神在外正南停留2天
　　庚辰 辛巳                         胎神在外正西停留2天 
　　壬午 癸未 甲申 乙酉 丙戌 丁亥         胎神在外西北停留6天 
　　戊子 己丑 庚寅 辛卯 壬辰          胎神在外正北停留5天 
　　癸巳 甲午 乙未 丙申 丁酉             胎神在房内北停留5天  
　　戊戌 己亥 庚子 辛丑 壬寅 癸卯         胎神在房内南停留6天  
　　甲辰 乙巳 丙午 丁未 戊申             胎神在房内東停留5天
　　己酉 庚戌 辛亥 壬子 癸丑 甲寅         胎神在外東北停留6天
　　乙卯 丙辰 丁巳 戊午 己未             胎神在外正東停留5天
　　庚申 辛酉 壬戌 癸亥 甲子 乙丑          胎神在外東南停留6天 
　　丙寅 丁卯 戊辰 己巳 庚午             胎神在外正南停留5天
 */
export const FETAL_GOD_DAY_DIRECTION2 = [
   2,  2,  3,  3,  3,  3,  3,  4,  4,  4, 
   4,  4,  4,  4,  3,  3,  5,  5,  6,  6,
   6,  6,  6,  6,  7,  7,  7,  7,  7, -7,
  -7, -7, -7, -7, -3, -3, -3, -3, -3, -3,
  -1, -1, -1, -1, -1,  8,  8,  8,  8,  8,
   8,  1,  1,  1,  1,  1,  2,  2,  2,  2
]
