/**
 *纳音五行
  五行顺序  
    0     1     2     3    4
  ['木', '火', '土', '金', '水']
  '''
    '海中金', '爐中火', '大林木', '路旁土',
    '劍鋒金', '山頭火', '澗下水', '城頭土',
    '白臘金', '楊柳木', '井泉水', '屋上土',
    '霹靂火', '松柏木', '長流水', '砂中金',
    '山下火', '平地木', '壁上土', '金箔金',
    '覆燈火', '天河水', '大驛土', '釵釧金',
    '桑柘木', '大溪水', '砂中土', '天上火',
    '石榴木', '大海水'
  '''
 */
  export const TAKE_SOUND_ELEMENT5 = [
    3, 1, 0, 2,
    3, 1, 4, 2,
    3, 0, 4, 2,
    1, 0, 4, 3,
    1, 0, 2, 3,
    1, 4, 2, 3,
    0, 4, 2, 1,
    0, 4
  ]
  