export const commonAct = (
  '祭祀 祈福 求嗣 上冊受封 上表章 襲爵受封 ' +
  '會親友 入學 冠帶 出行 上官赴任 臨政親民 ' +
  '結婚姻 納采問名 嫁娶 進人口 移徙 遠回 ' +
  '安床 解除 沐浴 剃頭 整手足甲 求醫療病 ' +
  '療目 針刺 裁衣 筑堤防 修造動土 豎柱上梁' +
  '修倉庫 鼓鑄 苫蓋 經絡 醞釀 開市 ' +
  '立券 交易 納財 開倉庫 出貨財 修置產室 ' +
  '開渠穿井 安碓磑 補垣塞穴 掃舍宇 修飾垣墻 平治道涂 ' +
  '破屋壞垣 伐木 捕捉 畋獵 取魚 乘船渡水 ' +
  '栽種 牧養 納畜 破土 安葬 啟攢'
).split(' ')

// 天德月德天德合月德合所宜 (天赦亦然)
export const deGoodAct = (
  '祭祀 祈福 求嗣 上冊進表章 頒詔 覃恩 肆赦 施恩封拜 詔命公卿 ' +
  '招賢 舉正直 施恩惠 恤孤煢 宣政事 行惠愛 雪冤枉 緩刑獄 慶賜 賞賀 宴會 行幸 ' +
  '遣使 安撫邊境 選將訓兵 出師 上官赴任 臨政親民 結婚姻 納采問名 嫁娶 般移 解除 ' +
  '求醫療病 裁製 營建宮室 繕城郭 興造動土 豎柱上梁 修倉庫 栽種 牧養 納畜 安葬'
).split(' ')

// 天願 (比天德少了解除 療病，多了經絡  醞釀等)
export const heavenWishGoodAct = (
  '祭祀 祈福 求嗣 上冊進表章 頒詔 覃恩 肆赦 施恩封拜 詔命公卿 ' +
  '招賢 舉正直 施恩惠 恤孤煢 宣政事 行惠愛 雪冤枉 緩刑獄 慶賜 賞賀 宴會 行幸 ' +
  '遣使 安撫邊境 選將訓兵 出師 上官赴任 臨政親民 結婚姻 納采問名 嫁娶 進人口 般移 ' +
  '裁製 營建宮室 繕城郭 興造動土 豎柱上梁 修倉庫 經絡 醞釀 開市 立券 交易 納財 栽種 牧養 納畜 安葬'
).split(' ')

// 月恩 四相 時德
export const snDeGoodAct = (
  '祭祀 祈福 求嗣 施恩封拜 舉正直 慶賜 賞賀 宴會 行幸 遣使 ' +
  '上官赴任 臨政親民 結婚姻 納采問名 般移 解除 ' +
  '求醫療病 裁製 修宮室 繕城郭 興造動土 豎柱上梁 納財 開倉庫 出貨財 栽種 牧養'
).split(' ')

// 劫煞
export const jieShaBadAct = (
  '祈福 求嗣 上冊進表章 頒詔 施恩封拜 詔命公卿 ' +
  '招賢 舉正直 宣政事 布政事 慶賜 賞賀 宴會 冠帶 行幸 遣使 ' +
  '安撫邊境 選將訓兵 出師 上官赴任 臨政親民 結婚姻 納采問名 嫁娶 般移 安床 ' +
  '解除 整容 剃頭 整手足甲 ' +
  '求醫療病 裁製 營建宮室 修宮室 繕城郭 興造動土 豎柱上梁 修倉庫 ' +
  '鼓鑄 經絡 醞釀 開市 立券 交易 納財 開倉庫 出貨財 修置產室 開渠穿井 ' +
  '安碓磑 掃舍宇 修飾垣墻 破屋壞垣' +
  '栽種 牧養 納畜 破土 安葬 啟攢'
).split(' ')

// 大時 天吏 之忌
export const bigTimeBadAct = (
  '祈福 求嗣 上冊進表章 施恩封拜 詔命公卿 ' +
  '招賢 舉正直 冠帶 行幸 遣使 ' +
  '安撫邊境 選將訓兵 出師 上官赴任 臨政親民 結婚姻 納采問名 嫁娶 進人口 般移 安床 ' +
  '解除 ' +
  '求醫療病 營建宮室 修宮室 繕城郭 筑堤防 興造動土 豎柱上梁 修倉庫 ' +
  '開市 立券 交易 納財 開倉庫 出貨財 修置產室 ' +
  '栽種 牧養 納畜 '
).split(' ')
