/* eslint-disable prettier/prettier */
// 月朔周期平均天数
const moonCycle = 29.53059

// 月球自转周期天数
const moonRotationCycle = 27.32166

// 星座
const CONSTELLATION_NAME = [
  '白羊座',
  '金牛座',
  '双子座',
  '巨蟹座',
  '狮子座',
  '处女座',
  '天秤座',
  '天蝎座',
  '射手座',
  '摩羯座',
  '水瓶座',
  '双鱼座'
]

// 二十四节气
const SOLAR_TERMS = [
  '小寒','大寒',
  '立春','雨水','惊蛰','春分','清明','谷雨',
  '立夏','小满','芒种','夏至','小暑','大暑',
  '立秋','处暑','白露','秋分','寒露','霜降',
  '立冬','小雪','大雪','冬至'
]

// 二十八星宿
const wentyEightStars = [
  // 四       五      六       日       一       二      三
  '角木蛟','亢金龙','女土蝠','房日兔','心月狐','尾火虎','箕水豹',
  '斗木獬','牛金牛','氐土貉','虚日鼠','危月燕','室火猪','壁水獝',
  '奎木狼','娄金狗','胃土彘','昴日鸡','毕月乌','觜火猴','参水猿',
  '井木犴','鬼金羊','柳土獐','星日马','张月鹿','翼火蛇','轸水蚓'
]
